#2.1
print(100,"+",200,"=", 100 + 200)
print(200,"+",300,"+",400,"=",200 + 300+ 400)

#2.3
width=30
height=60
print("사각형의 면적:", width * height)

#2.5
answer = int(input('정사각형의 밑변을 입력하시오:'))
print('정사각형의 면적:', answer **2 )

#2.7
digit = 1*2*3*4*5*6*7*8*9
print('10!=', digit)

#2.9
print('섭씨 화씨')
for C in range(0,51,10):
    F= C * 9/5 + 32
    print(f'{C} {F}')

#2.11
F= int(input("화씨 온도를 입력하세요:"))
print("화씨", F, "도는 화씨", (F - 32) * 5/9, "도 입니다.")

#2.13
PI = 3.141592
r = int(input('원의 반지름을 입력하세요 : '))
print('원의 둘레 = ', 2*PI*r, ",", '원의 면적 = ', PI*r**2)

#2.15
a = int(input('밑변을 입력하세요 : '))
b = int(input('높이를 입력하세요 : '))
c = print('빗변 : ', (a**2 + b**2)**0.5)

#2.17

print(2<<0, 2<<1, 2<<2, 2<<3,2<<4,2<<5,2<<6,2<<7,2<<8,2<<9)

#2.19
n = int(input('정수를 입력하세요: '))
if n % 2 == 0 and 0 <= n <= 100:
        print('입력된 정수는 0에서 100범위 안에 있는 짝수인가요? True')
else:
        print('입력된 정수는 0에서 100범위 안에 있는 짝수인가요? False')

#2.21
n = int(input('정수를 입력하시오: '))
print('9 의 2진수 값:', bin(9) )
print('9 의 2진수 값에 대한 비트단위 부정값:', bin(~9))

#2.23
num = int(input('세 자리 정수를 입력하시오:'))
print('백의 자리:', (num // 100)%10)
print('십의 자리:', (num // 10)% 10)
print('일의 자리:', num % 10)
